## SQL Practices

In [1]:
# Load Magic commands
import sqlite3
%load_ext sql

# Load SQLite database
%sql sqlite:///pandp.db

In [2]:
%%sql
SELECT name tables
FROM sqlite_master 
WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' 
ORDER BY 1;

 * sqlite:///pandp.db
Done.

[('accounts',), ('orders',), ('region',), ('sales_reps',), ('web_events',)]

### order by

In [3]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY account_id, total_amt_usd DESC
limit 5;

 * sqlite:///pandp.db
Done.

[(4308, 1001, 9426.71),
 (4309, 1001, 9230.67),
 (4316, 1001, 9134.31),
 (4317, 1001, 8963.91),
 (4314, 1001, 8863.24)]

In [4]:
%%sql
SELECT id, account_id, total_amt_usd
FROM orders
ORDER BY total_amt_usd DESC, account_id
limit 5;

 * sqlite:///pandp.db
Done.

[(4016, 4251, 232207.07),
 (3892, 4161, 112875.18),
 (3963, 4211, 107533.55),
 (5791, 2861, 95005.82),
 (3778, 4101, 93547.84)]

### where

In [5]:
%%sql
SELECT *
FROM orders
WHERE account_id = 4251
ORDER BY occurred_at
LIMIT 1000;

 * sqlite:///pandp.db
Done.

[(6719, 4251, '2016-06-05 01:16:37', 0, 78, 0, 78, 0, 584.22, 0, 584.22),
 (4009, 4251, '2016-06-05 01:36:42', 626, 15, 0, 641, 3123.74, 112.35, 0, 3236.09),
 (4010, 4251, '2016-07-04 12:34:49', 498, 6, 2, 506, 2485.02, 44.94, 16.24, 2546.2),
 (4011, 4251, '2016-08-02 00:53:28', 679, 36, 5, 720, 3388.21, 269.64, 40.6, 3698.45),
 (6720, 4251, '2016-08-02 01:13:08', 9, 0, 19, 28, 44.91, 0, 154.28, 199.19),
 (4012, 4251, '2016-09-01 02:32:51', 503, 13, 32, 548, 2509.97, 97.37, 259.84, 2867.18),
 (6721, 4251, '2016-09-01 02:39:55', 3, 71, 50, 124, 14.97, 531.79, 406, 952.76),
 (4013, 4251, '2016-09-30 13:31:53', 503, 39, 0, 542, 2509.97, 292.11, 0, 2802.08),
 (4014, 4251, '2016-10-29 12:04:06', 483, 12, 0, 495, 2410.17, 89.88, 0, 2500.05),
 (6722, 4251, '2016-11-27 15:16:07', 19, 56, 0, 75, 94.81, 419.44, 0, 514.25),
 (4015, 4251, '2016-11-27 15:17:06', 520, 21, 7, 548, 2594.8, 157.29, 56.84, 2808.93),
 (6723, 4251, '2016-12-26 08:39:56', 0, 31, 21, 52, 0, 232.19, 170.52, 402.71),
 (4016, 4251, '2016-12-26 08:53:24', 521, 16, 28262, 28799, 2599.79, 119.84, 229487.44, 232207.07)]

In [6]:
%%sql
SELECT *
FROM orders
WHERE gloss_amt_usd >= 1000
LIMIT 5;

 * sqlite:///pandp.db
Done.

[(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58),
 (62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94),
 (88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33),
 (121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0, 2365.93),
 (129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)]

In [7]:
%%sql
SELECT *
FROM orders
WHERE total_amt_usd < 500
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(67, 1091, '2015-04-07 13:29:20', 95, 0, 0, 95, 474.05, 0, 0, 474.05),
 (96, 1101, '2016-03-15 11:36:03', 14, 8, 16, 38, 69.86, 59.92, 129.92, 259.7),
 (119, 1131, '2016-06-12 12:29:45', 0, 30, 23, 53, 0, 224.7, 186.76, 411.46),
 (124, 1131, '2016-11-07 05:10:56', 0, 0, 0, 0, 0, 0, 0, 0),
 (254, 1251, '2014-11-01 02:15:24', 0, 0, 17, 17, 0, 0, 138.04, 138.04),
 (328, 1291, '2015-08-03 08:35:23', 0, 19, 21, 40, 0, 142.31, 170.52, 312.83),
 (542, 1421, '2015-11-13 09:07:09', 0, 64, 0, 64, 0, 479.36, 0, 479.36),
 (683, 1501, '2016-04-14 23:59:50', 0, 15, 16, 31, 0, 112.35, 129.92, 242.27),
 (713, 1521, '2014-11-23 16:04:03', 0, 8, 10, 18, 0, 59.92, 81.2, 141.12),
 (730, 1521, '2016-05-06 02:34:48', 0, 0, 2, 2, 0, 0, 16.24, 16.24)]

In [8]:
%%sql
SELECT *
FROM accounts
WHERE name = 'United Technologies'

 * sqlite:///pandp.db
Done.

[(1441, 'United Technologies', 'www.utc.com', 42.329397, -75.15785469, 'Janett Wisecarver', 321520)]

In [9]:
%%sql
SELECT *
FROM accounts
WHERE name != 'United Technologies'
limit 5

 * sqlite:///pandp.db
Done.

[(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500),
 (1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510),
 (1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520),
 (1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530),
 (1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)]

In [10]:
%%sql
SELECT name, website, primary_poc
FROM accounts
WHERE name = 'Exxon Mobil'

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')]

### Arthmetic

In [11]:
%%sql
SELECT account_id,
       occurred_at,
       standard_qty,
       gloss_qty + poster_qty AS nonstandard_qty
FROM orders
limit 5;

 * sqlite:///pandp.db
Done.

[(1001, '2015-10-06 17:31:14', 123, 46),
 (1001, '2015-11-05 03:34:33', 190, 98),
 (1001, '2015-12-04 04:21:55', 85, 47),
 (1001, '2016-01-02 01:18:24', 144, 32),
 (1001, '2016-02-01 19:27:27', 108, 57)]

In [12]:
%%sql
SELECT id, account_id, standard_amt_usd/standard_qty AS unit_price
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 4.99),
 (2, 1001, 4.99),
 (3, 1001, 4.989999999999999),
 (4, 1001, 4.989999999999999),
 (5, 1001, 4.989999999999999),
 (6, 1001, 4.99),
 (7, 1001, 4.99),
 (8, 1001, 4.99),
 (9, 1001, 4.989999999999999),
 (10, 1001, 4.99)]

In [13]:
%%sql
SELECT id, account_id, 
poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
FROM orders
LIMIT 10;

 * sqlite:///pandp.db
Done.

[(1, 1001, 0.20019929527546923),
 (2, 1001, 0.269401582044551),
 (3, 1001, 0.0),
 (4, 1001, 0.0),
 (5, 1001, 0.23117672777557474),
 (6, 1001, 0.349983602717264),
 (7, 1001, 0.49862501668669074),
 (8, 1001, 0.5974661339050775),
 (9, 1001, 0.23737326760301367),
 (10, 1001, 0.07393917319249681)]

### like

In [14]:
%%sql
SELECT *
FROM accounts
WHERE website LIKE '%google%';

 * sqlite:///pandp.db
Done.

[(1351, 'Alphabet', 'www.google.com', 40.20427811, -75.07724145, 'Pamula Hammel', 321640)]

In [15]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE 'C%';

 * sqlite:///pandp.db
Done.

[('CVS Health',),
 ('Chevron',),
 ('Costco',),
 ('Cardinal Health',),
 ('Citigroup',),
 ('Comcast',),
 ('Cisco Systems',),
 ('Caterpillar',),
 ('Coca-Cola',),
 ('Cigna',),
 ('CHS',),
 ('ConocoPhillips',),
 ('Capital One Financial',),
 ('Centene',),
 ('Community Health Systems',),
 ('Cummins',),
 ('CenturyLink',),
 ('Colgate-Palmolive',),
 ('ConAgra Foods',),
 ('CarMax',),
 ('CBS',),
 ('C.H. Robinson Worldwide',),
 ('CDW',),
 ('Chesapeake Energy',),
 ('Consolidated Edison',),
 ('Cognizant Technology Solutions',),
 ('Computer Sciences',),
 ('CSX',),
 ('CBRE Group',),
 ('Charter Communications',),
 ('CST Brands',),
 ('Celgene',),
 ('Corning',),
 ('Core-Mark Holding',),
 ('Cameron International',),
 ('Crown Holdings',),
 ('Campbell Soup',)]

In [16]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%one%';

 * sqlite:///pandp.db
Done.

[('Honeywell International',),
 ('INTL FCStone',),
 ('Capital One Financial',),
 ('AutoZone',),
 ('Oneok',)]

In [17]:
%%sql
SELECT name
FROM accounts
WHERE name LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('General Motors',),
 ('United Technologies',),
 ("Lowe's",),
 ('UPS',),
 ('Cisco Systems',)]

## In

In [18]:
%%sql
SELECT *
FROM orders
WHERE account_id IN (1001,1021)
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49)]

In [19]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name IN ('Walmart', 'Target', 'Nordstrom');

 * sqlite:///pandp.db
Done.

[('Walmart', 'Tamara Tuma', 321500),
 ('Target', 'Luba Streett', 321660),
 ('Nordstrom', 'Yan Crater', 321820)]

### Not

In [20]:
%%sql
SELECT sales_rep_id, 
       name
FROM accounts
WHERE sales_rep_id NOT IN (321500,321570)
ORDER BY sales_rep_id
limit 5;

 * sqlite:///pandp.db
Done.

[(321510, 'Exxon Mobil'),
 (321510, 'J.P. Morgan Chase'),
 (321510, 'PepsiCo'),
 (321510, 'Energy Transfer Equity'),
 (321510, 'Delta Air Lines')]

In [21]:
%%sql
SELECT *
FROM accounts
WHERE website NOT LIKE '%com%';

 * sqlite:///pandp.db
Done.

[(1811, 'TIAA', 'www.tiaa.org', 42.3595683, -71.05133234, 'Deeanna Burpo', 321640),
 (2241, 'Community Health Systems', 'www.chs.net', 41.87567906, -87.63221831, 'Grazyna Dewald', 321710)]

In [23]:
%%sql
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name NOT IN ('Walmart', 'Target', 'Nordstrom')
limit 5;

 * sqlite:///pandp.db
Done.

[('Exxon Mobil', 'Sung Shields', 321510),
 ('Apple', 'Jodee Lupo', 321520),
 ('Berkshire Hathaway', 'Serafina Banda', 321530),
 ('McKesson', 'Angeles Crusoe', 321540),
 ('UnitedHealth Group', 'Savanna Gayman', 321550)]

In [25]:
%%sql
SELECT *
FROM web_events
WHERE channel NOT IN ('organic', 'adwords')
limit 5;

 * sqlite:///pandp.db
Done.

[(1, 1001, '2015-10-06 17:13:58', 'direct'),
 (2, 1001, '2015-11-05 03:08:26', 'direct'),
 (3, 1001, '2015-12-04 03:57:24', 'direct'),
 (4, 1001, '2016-01-02 00:55:03', 'direct'),
 (5, 1001, '2016-02-01 19:02:33', 'direct')]

In [27]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE '%s'
limit 5;

 * sqlite:///pandp.db
Done.

[('Walmart',),
 ('Exxon Mobil',),
 ('Apple',),
 ('Berkshire Hathaway',),
 ('McKesson',)]

### AND & Between

In [29]:
%%sql
SELECT *
FROM orders
WHERE occurred_at >= '2016-04-01' AND occurred_at <= '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [31]:
%%sql
SELECT *
FROM orders
WHERE occurred_at BETWEEN '2016-04-01' AND '2016-10-01'
ORDER BY occurred_at
limit 5;

 * sqlite:///pandp.db
Done.

[(1757, 2341, '2016-04-01 04:39:00', 500, 0, 21, 521, 2495, 0, 170.52, 2665.52),
 (1591, 2181, '2016-04-01 06:10:39', 298, 194, 0, 492, 1487.02, 1453.06, 0, 2940.08),
 (4312, 1001, '2016-04-01 11:15:27', 497, 618, 152, 1267, 2480.03, 4628.82, 1234.24, 8343.09),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (589, 1441, '2016-04-01 16:01:34', 317, 38, 1, 356, 1581.83, 284.62, 8.12, 1874.57)]

In [32]:
%%sql
SELECT *
FROM orders
WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0;

 * sqlite:///pandp.db
Done.

[(2613, 2951, '2016-08-15 00:06:12', 1171, 0, 0, 1171, 5843.29, 0, 0, 5843.29),
 (3260, 3491, '2014-08-29 22:43:00', 1552, 0, 0, 1552, 7744.48, 0, 0, 7744.48)]

In [34]:
%%sql
SELECT name
FROM accounts
WHERE name NOT LIKE 'C%' AND name LIKE '%s'
limit 4;

 * sqlite:///pandp.db
Done.

[('General Motors',), ('United Technologies',), ("Lowe's",), ('UPS',)]

In [ ]:
%%sql